[
  {
    "word": "capricious",
    "pronunciation": "/kəˈprɪʃəs/",
    "partOfSpeech": "adjective",
    "meaning": "given to sudden and unaccountable changes of mood or behavior",
    "difficulty": 2,
    "etymology": "From Italian 'capriccio,' meaning a sudden start or impulse",
    "examples": [
      "The capricious weather in Jaipur made it almost impossible to plan the outdoor wedding ceremony.",
      "His capricious decisions in business kept colleagues always on their toes.",
      "She grew tired of her friend's capricious texts, never knowing when she'd hear from her next.",
      "The capricious schedule of the poet meant that she sometimes wrote all night and slept through the day.",
      "With a capricious sweep of her arm, she changed the seating arrangement—again.",
      "The capricious river carved new banks after each heavy monsoon, reshaping the landscape yearly.",
      "Her capricious sense of humor alternated between sharp wit and gentle teasing."
    ]
  },
  {
    "word": "lugubrious",
    "pronunciation": "/luːˈɡuːbriəs/",
    "partOfSpeech": "adjective",
    "meaning": "looking or sounding sad and dismal",
    "difficulty": 2,
    "etymology": "From Latin 'lugubris,' from 'lugere' meaning 'to mourn'",
    "examples": [
      "The lugubrious tune of the shehnai played as the old year faded at midnight.",
      "He wore a lugubrious expression throughout the ceremony, unmoved by the celebration.",
      "Her lugubrious letters home hinted at a homesickness deeper than she could admit aloud.",
      "The painting’s lugubrious tones created a somber mood in the entire gallery.",
      "Even the monsoon rain seemed less lugubrious than her heartbreak that July.",
      "A lugubrious silence filled the classroom after the teacher announced the test results.",
      "His lugubrious storytelling made every farewell sound final."
    ]
  },
  {
    "word": "vociferous",
    "pronunciation": "/voʊˈsɪfərəs/",
    "partOfSpeech": "adjective",
    "meaning": "expressing opinions or feelings loudly and forcefully",
    "difficulty": 2,
    "etymology": "From Latin 'vociferari,' meaning 'to shout, yell'",
    "examples": [
      "The vociferous protestors in the city square demanded real change from the government.",
      "His vociferous objections to the plan ensured everyone heard his point of view.",
      "The vociferous crows in the mango tree woke the entire neighborhood at dawn.",
      "They were vociferous fans, chanting loudly for their favorite cricketer until the last over.",
      "Her vociferous laughter filled the house during family gatherings.",
      "Even as a child, Maya was a vociferous reader, insisting on reciting every story aloud.",
      "His vociferous defense of his friends made him a loyal companion, if sometimes exhausting."
    ]
  },
  {
    "word": "recalcitrant",
    "pronunciation": "/rɪˈkalsɪtrənt/",
    "partOfSpeech": "adjective",
    "meaning": "stubbornly refusing to obey rules or orders",
    "difficulty": 2,
    "etymology": "From Latin 'recalcitrare,' meaning 'to kick back,' from 're-' (back) + 'calx' (heel)",
    "examples": [
      "The recalcitrant software refused to update, no matter how many times she restarted the computer.",
      "Her recalcitrant attitude made teachers both admire her spirit and worry about her grades.",
      "Dealing with a recalcitrant toddler taught Rahul the meaning of patience.",
      "The recalcitrant weeds in the garden thrived despite every effort to uproot them.",
      "The committee faced recalcitrant members who would not compromise on any point.",
      "She was known for her recalcitrant stance against all forms of injustice.",
      "Negotiating with recalcitrant clients became his unwanted specialty."
    ]
  },
  {
    "word": "unctuous",
    "pronunciation": "/ˈʌŋktjuəs/",
    "partOfSpeech": "adjective",
    "meaning": "excessively or ingratiatingly flattering; oily",
    "difficulty": 2,
    "etymology": "From Latin 'unctuosus,' from 'unguere' meaning 'to anoint with oil'",
    "examples": [
      "His unctuous compliments at the dinner table soon lost their appeal.",
      "An unctuous sales pitch made her distrustful of, rather than interested in, the new product.",
      "The film’s villain was portrayed as an unctuous bureaucrat with a perpetual smirk.",
      "She spotted the unctuous tone in his emails as he tried to curry favor with management.",
      "Even the unctuous texture of the sauce could not disguise that the dish was burnt.",
      "He offered unctuous apologies after being caught cheating, but no one believed his sincerity.",
      "A waiter with an unctuous manner hovered at their table all night."
    ]
  },
  {
    "word": "intransigent",
    "pronunciation": "/ɪnˈtrænsədʒənt/",
    "partOfSpeech": "adjective",
    "meaning": "unwilling or refusing to change one's views or to agree about something",
    "difficulty": 2,
    "etymology": "From Spanish 'intransigente,' from Latin 'in-' (not) + 'transigere' (to come to an agreement)",
    "examples": [
      "Both sides remained intransigent even as the negotiations dragged on for weeks.",
      "His intransigent attitude frustrated the entire group project.",
      "The intransigent policy left no room for discussion or flexibility.",
      "She was intransigent about her morning routine, regardless of how late she had gone to bed.",
      "The union’s intransigent stance led to a prolonged strike.",
      "Despite the evidence, the committee chair remained intransigent, refusing to reconsider.",
      "Their intransigent refusal to modernize eventually led to the company’s downfall."
    ]
  },
  {
    "word": "inveterate",
    "pronunciation": "/ɪnˈvɛtərət/",
    "partOfSpeech": "adjective",
    "meaning": "having a particular habit, activity, or interest that is long-established and unlikely to change",
    "difficulty": 2,
    "etymology": "From Latin 'inveteratus,' past participle of 'inveterare' meaning 'to make old'",
    "examples": [
      "He was an inveterate traveler, never staying in one city for longer than a season.",
      "Her inveterate habit of double-checking every lock made her the last to leave the house.",
      "An inveterate coffee drinker, she collected beans from all over the world.",
      "His inveterate pessimism made even good news sound ominous.",
      "Even after retirement, my uncle remained an inveterate storyteller at every family gathering.",
      "The inveterate rivalry between the two schools spanned decades.",
      "As an inveterate early riser, she used the quiet hours for meditation."
    ]
  },
  {
    "word": "magnanimous",
    "pronunciation": "/mæɡˈnænɪməs/",
    "partOfSpeech": "adjective",
    "meaning": "very generous or forgiving, especially toward a rival or someone less powerful",
    "difficulty": 2,
    "etymology": "From Latin 'magnanimus,' from 'magnus' (great) + 'animus' (soul)",
    "examples": [
      "Despite the harsh criticism, the author gave a magnanimous response.",
      "His magnanimous gesture after the competition won him lasting respect.",
      "She was magnanimous in victory, praising her opponent’s hard work.",
      "A magnanimous leader, he forgave former rivals and welcomed them as allies.",
      "Their magnanimous donation saved the library from closing.",
      "Even after the argument, her friend made a magnanimous invitation to dinner.",
      "The judge’s magnanimous decision reflected her deep understanding of human nature."
    ]
  },
  {
    "word": "redolent",
    "pronunciation": "/ˈrɛdələnt/",
    "partOfSpeech": "adjective",
    "meaning": "strongly reminiscent or suggestive of something; fragrant or sweet-smelling",
    "difficulty": 2,
    "etymology": "From Latin 'redolere' meaning 'to emit a smell'",
    "examples": [
      "The kitchen was redolent of cinnamon and cardamom, promising a festive meal.",
      "His stories were redolent of the old village, every detail evoking a sense of home.",
      "The garden was redolent with the scent of jasmine by dusk.",
      "Their laughter was redolent of endless summer holidays.",
      "The dusty library felt redolent of untold secrets and forgotten conversations.",
      "She wore a perfume redolent of the sea breeze and fresh linen.",
      "The passage was redolent of old-world charm, with carved doors and climbing bougainvillea."
    ]
  },
  {
    "word": "tumultuous",
    "pronunciation": "/tuːˈmʌltʃuəs/",
    "partOfSpeech": "adjective",
    "meaning": "making a loud, confused noise; uproarious",
    "difficulty": 2,
    "etymology": "From Latin 'tumultuosus' meaning 'full of confusion or disorder'",
    "examples": [
      "The crowd’s tumultuous applause lasted for several minutes after the final song.",
      "They shared a tumultuous relationship, filled with both passion and arguments.",
      "The city center was tumultuous during the festival parade, with music on every street.",
      "Her thoughts grew tumultuous after the unexpected phone call.",
      "The player’s tumultuous debut thrilled fans and critics alike.",
      "Thunderstorms made for a tumultuous night in the old village.",
      "The announcement was greeted with tumultuous cheers and celebratory whistles."
    ]
  }
]
